let partialRemoteUrlToDetect = "microsoft.com"; // Change this to a URL you'd like to find machines connecting to
DeviceNetworkEvents  
| where Timestamp > ago(7d) // can be changed to any day
and RemoteUrl has partialRemoteUrlToDetect // Can be changed to "contains" operator as explained above
| project Timestamp, RemoteUrl, DeviceName, DeviceId, ReportId, InitiatingProcessAccountName
| top 1000 by Timestamp desc //take out this line for more results