//Cleartext Passwords Saved on Machine
DeviceFileEvents
| where (FileName contains 'password' or FileName contains 'PWD' or FileName contains 'pass')
| where (FileName endswith '.docx' or FileName endswith '.txt' or FileName endswith '.xlsx' or FileName endswith '.PPTX' or FileName endswith '.rtf' or FileName endswith '.csv' or FileName endswith '.eml')
|project Timestamp, ActionType, FileName, FolderPath, DeviceName, PreviousFolderPath, PreviousFileName, FileSize, DeviceId, InitiatingProcessAccountName, InitiatingProcessFolderPath, InitiatingProcessFileSize,InitiatingProcessParentCreationTime, ReportId