DeviceImageLoadEvents
| where (InitiatingProcessFileName =~ "vlc.exe" or InitiatingProcessVersionInfoOriginalFileName =~ "vlc.exe" or InitiatingProcessSHA256 =~ "6f924de3f160984740fbac66cf9546125330fc00f4f5d2dbf05601d9d930b7d9" or InitiatingProcessFileName =~ "googleupdate.exe")
| where (SHA256 =~ "c348eba51897fbd55ca3ffdaab21259b8f73688e6e008b923ebc597c6272d2d9") or (FolderPath =~ @"C:\ProgramData\GoogleUpdate\libvlc.dll")