//Initial Access: processes spawned by CMD.EXE from a removable media device.
let DNS_Hostname_Hit = view () {
union DeviceEvents, DeviceProcessEvents,DeviceFileEvents,DeviceRegistryEvents,DeviceLogonEvents,DeviceImageLoadEvents, DeviceNetworkEvents, DeviceNetworkInfo, DeviceInfo
    | where DnsAddresses in("1156av.com", "182135.com", "420mountain.tk", "a.nel.cloudflare.com", "abgkll.com", "advtech.ru", "adxtro.com", "aranawards.com", "asianpinay.com", "assc.us", "atrax.io", "autosandcartalk.com", 
        "avira.ltd", "avira.me.uk", "baunetz-architekten.de", "behangbypauw.nl", "bellinghamwindworks.com", "bellissimafashions.com", "bermainid88.com", "bestxxxsites.com", "bmanuka.co.il", "bonshi.net", "box4good.com", "brizol.ru", 
        "bronze-trader.com", "brooklinecollege.edu", "bsimg.cn", "btrazer.com", "buyvoetsmode.nl", "buzzito.net", "bwm.no", "caproyale.com", "casinoepoca.com", "ccad.edu", "cebalrai.com", "chinahousecityroad.co.uk", 
        "cihrs.org", "cloud-avira.com", "cocolegal.com.br", "colonialghosts.com", "corefight.or.id", "corporatecaronline.com", "cupomzeiros.com", "czlondon.com", "dappstore.me", "deluxe-vulcan-stavka.biz", "dettolproindia.in", 
        "devaskation.com", "diadata.org", "digitalperformanceday.dk", "directcall.com.br", "disabilityatdisney.com", "dnx.co.uk", "dogetrack.io", "dryeyevitamin.com", "ducttapemarketing.com", "ecemarbleexclusive.com", "ecomarket.ru", 
        "educarestodo.com", "e-potion.ro", "expressgrillandcurry.com", "ezisay.com", "fappy.com", "fdjcollection.com", "fieldwatch.co", "fiper.net", "fit4day.nl", "floridaaddictiontreatmentcenters.com", "fordiscord.com", "fututec.dev", 
        "fxvc.eu", "gamesndeals.in", "getdutchie.com", "getincanada.ca", "gidapp.com", "gingerindianrestaurant.com", "giztop.com", "goldenwokharleston.com", "gomakesomememories.com.au", "go-ph777.com", "gracerevonline.com", 
        "greenland-xchange.com", "gwtltd.com", "hb-noo1.com", "healthy-solutions-and-the-good-life.com", "hellosolar.net", "hexa-vital.de", "homelandjustice.cx", "homelandjustice.su", "homelandjustice.su ", "homelandjustice.top", 
        "homelandjustice.vc", "hottrendpod.com", "id88art.com", "incsgo.gg", "indiandelightstxtakeaway.com", "industrialcyber.co", "inspiravacations.com", "joelguerra.com", "jourj.co", "khadinatural.com", "knifegram.com", 
        "lavinacasino.com", "l-r-parts.nl", "mail.teylornidana.top 2", "mapkings.io", "maroctravelexperiences.com", "masno.tv", "metpar.com", "momnewsdaily.com", "nexgencanada.is", "nftonline.com", "nohardforks.com", "ocr.ca", 
        "offerxx1.ga", "ok-naira.com", "ottawa-psychologists.com", "peakcapitaltrading.com", "pgp.eu.com", "pildid.paikesetants.ee", "pilotcareernews.com", "pinupbet191.com", "planmygapyear.co.uk", "playsharp.io", "playtexbaby.com", 
        "popsockets.ro", "pragmaticus.ru", "primax.com.pe", "quickspizza.co.uk", "rbxloot.ca", "rectangletrkr.com", "restogurih7.com", "revelkingdom.us", "rose-boutique.nl", "sashares.co.za", "server-avira.com", "shout.com.au", 
        "shoutdigital.com.au", "skimsafe.se", "skype.se.net", "skype.se.net", "spit.com.au", "sportline.com.sv", "steintravel.ie", "stopandshop.fr", "storimity.com", "sttr.qc.ca", "supergame.one", "szkidapp.com", "t2a2.co.uk", 
        "taern.pl", "telegram-update.com", "teylornidana.top", "th3cousins.com", "thdwholesale.com", "thestreetthaionline.co.uk", "thumbsatplay.com", "tmbtc.io", "topgamblingdeals.com", "traderjoexyz.net", "transitionsmobility.com", 
        "t-shirtsoccer.com", "tsunami24.ru", "turkey-fbs-fx.com", "typo3.mt-design.ch", "uk2privat.com", "update-pgp.com", "update-real.com", "uwamakers.com", "velocidadereal.com", "vipmv.tv", "visual-dream.eu", "voxpow.com", 
        "wildernesstimes.com", "windowsupadates.com", "wordwool.com", "wtffunfact.com", "www.akronhistory.org", "www.ciask8.com.br", "www.drugoisport.ru", "www.eliteblacksmith.com", "www.homelandjustice.cx ", "www.homelandjustice.su", 
        "www.nk.ca", "www.stylebakery.com", "www.teylornidana.top ", "www.thehebrides.ca", "www.westrong.net", "xfarmacia.app", "yakult.com.tw", "zpit.pl", "zqscore.com")
    | extend DateFormat=format_datetime(Timestamp, 'yy-MM-dd')
    | extend ThreatHunting = "DNS_Hostname_Hit"
}; 
//Execution: Command Line events containing /R
let IP_Hit = view () {
union DeviceEvents, DeviceProcessEvents,DeviceFileEvents,DeviceRegistryEvents,DeviceLogonEvents,DeviceImageLoadEvents, DeviceNetworkEvents, DeviceNetworkInfo, DeviceInfo
    | where RemoteIP in("103.109.100.233", "148.251.232.252", "148.251.233.231", "103.109.100.233", "104.26.2.154", "104.26.3.154", "108.175.159.114", "144.76.6.34", "17.12.218.219", "172.67.70.85", "176.9.18.143", "185.14.29.199", 
        "185.82.72.111", "188.114.96.12", "188.114.97.12", "188.114.99.192", "209.197.3.8", "216.24.219.64", "216.24.219.65", "3.67.156.202", "46.30.189.66", "81.28.12.12")
    | extend DateFormat=format_datetime(Timestamp, 'yy-MM-dd')
    | extend ThreatHunting = "IP_Hit"
}; 
//C2 - Generic: Outbound Powershell Events 
let SHA256_Hit = view () {
    // Finds PowerShell execution events that could involve a download
union DeviceEvents, DeviceProcessEvents,DeviceFileEvents,DeviceRegistryEvents,DeviceLogonEvents,DeviceImageLoadEvents, DeviceNetworkEvents, DeviceNetworkInfo, DeviceInfo
| where SHA256 in("dace1e3c2f7aa7675b03f88f5112a372f782560a2228f5369e2452f499a85a7d", "9e44bb2189b25a98fcf95c89357cecd3d9a674176dcb56d52abb877cf870c434", "82a37256ee65503e743d5c60651a3ef2954f889df00755ed1b7a0bdee575994b", "52f2d6d5f25237cfcbeb85d78ac2f42a4dddf7171487c3096f128f41f7abce43", "73ae0c79734c07c7351ca555c0842dfd252e4d20bc98026a9adfe3348d6930ed", "f7eac49e2303ad1b1e737962616b36b54df1cc61ecfdbc703fdded9b054e90cd", "1063686b9a033058c894d127b30e6e353204277bab68b57c493bf88e872c0a22", 
"e2981d6955899732d0c10b1927d4fd35d61907c938ced6628029f165f0ee51bc", "1bbb5ed2799ee86fc5c27ec8fb44a18e03b1312d5e914e0e4dc80b8eed172758", "7e68d668948f2e61fc0327782561ed0639c36c7b2f8614510b309adffbbabd93", "b63f4fb7983639266bcdd77c8dacb91d87d9955be08df19071b81d5cea9d613c", 
"49d1522176b5b2e748f4d97a5f7da5ad17bb6dbaceefcba2d0caafac42d4827e", "e5f87b1fae799705fb41c1bdc2181798dfb5b37c8681da707e86ff4b2e2f03ed", "e6ee8789abe85b15fddafd7b27a9ca927cbc42c13ecce0a0d6c11854257e79e2", "48cee3a52bda820261f2534aaed00403756d94c96370b0c1d24dec5fccd676d0", "92e6e8a1d1e102dc8d01384b5aea2ff2f1755f0a2338c67f6d4f6e167d2b01b7", "d5dc788e2f177c63da7cbe31b8fa7c67d7c696e3e00e2711726d91bfda2a2963", "9f53c0bbc783990556acfba034269e762d5c00923a2ce6b9c1c1acd810153e64", "d908dc82291337d88888a3a90c85feedcbee3360111fcb5fe63c1457dc313abe", 
"35287e7f9895e0fada36f5910036698662ef2a5af157ec1a15ea61bfe1f430f4", "f32e4314e532070abd9e0bc429ec2b8ed94189a8ed73ca37860fe07504a62af8", "dd30cc5ca2988baffc71ac3d34c01f6e6ca108dc400ecbbb2ce207de5d1ab33e", "eef5664e2266f86984e515b88d0408be93a9af269643884db54a451354465815", "09c6b915dcf4706512b5ecc24d5364b9000f48349924478db0a34ae958d5957e", "82edfc2b29eac0f845838cacfd4dd521cec54953c079ca0504612287cb0e31ba", "d6169ee4cb1e350e32a83a6e7d794a0e2412c7a7dfb96cf1246d6a4976869679", "dd4c47027ec79b34f3ea97aa1d05fcc1dcfc23c90867d77d37e9ccfd4654d591", 
"5319008c471fd8ed71d811559b62c949cfc00c0181dcddb0f8dd2fb06ce3f00f", "a7a23feb25f3f4814189f9f5c5c6d9ea591e24f446857f0bed05747f7601c6e3", "adcadc82c7d1b834c23a613ca01c56e218f3733106b71dea7064e84c9f304920", "159ec76405a6ffacf2ca493190859ef725569bc2fddb5b1494fd162026821379", "1642e50173d782006c0cb059cc4236cb6a0eb6f3c4fb3f963dbeaa33a0de907e", "d94d31e03cee30d67aeff10e024d774be62d1d26de6c5ce8ff381c19f4ff169a", "8eb7eb72ee9128c1aeb1a7eab2d4b58f2f87b3bca28eb8ff5217f07e2d57b90f", "e1ad542286922cd25cdbd715cd571add7a627fce62fb455a400f63a6bdd75fa3", "f7f89b3c1e58166f154a92754af8d021e71cc2fa3914b1bec017cc3b7a27810a", 
"9575a4aae8a57f7a7ea7ca7ad8bcd85cb87f9b6f1fc2637aa6a3dae9592f70f0", "be30406635e1940179004e7ae16f1f8a8baa646dc74ce10322c4ff46f97bfa01", "7799cff2bd10d7848b7e21f31cc78d1be000a92c869f53c72c69b07a0f511022", "baebb53ae5ffc7103327742d6847cb14a7e1cc2fddf4f74a0edf73a4c4379212", "8050677345d2f50fa0bb368e863786ead2f142aa4191c9314e9e9b97ebd9b190", 
"d1d17fd4ed84ca1ebafcdfa088daca55471aef4b3d95f0ba9eba6ec91050ff3e", "f0ca216b468b2d4a848400ed0d504e3a90c0c285061037bb8e7e73d40dd1ed2e", "c67204a5465172f2ddf8b1296f028c276d9451e62ccf12973fda2bad2fdb0279", "ac9eaac7f4728747f2f4e9ac7292336414ea895908210afa2647cb5beb55c2a7", 
"13c0378376e7e9204d2dd3d13a1e3a42d81295abd76bce0484105c973c7fac37", "05c14aea4cfd300a878399acc427f4e0f8133dd355ac9beb38bf6a4a31213b8a", "f8e25d28210914c74dfe0fff725aea9040e277409af7fa8a445ba2dbbccb3238", "846138b30038b0c605aa9b089c831b858516a877d4539b505f63b22548020e35", 
"77d6693c58aae5820a41de4e66342f1785d3d80a503338e4d3eeb93ac8008fb7", "d972a01eda59e7ef62941955197357c043d4784a404f1b88b4d971567f12ca86", "cf4067482d86bf6b1898878aac2ba07824fae50bfd4dda1499b127e6f189c149", "89039431c77b44381a4e00d2952f720d2f94e1f8c7aecc1f59ee92597b537bb9", 
"9703efa2adf802c094f21de0330438fb79680f7ea31deaa786d7172268618c27", "53a6a73efc57ffd75a8a7d4c7abe635a1078ec2443a0f2f291488daa3573eb34", "6bdb3a9ce6833cc4fbddfd58a43c1517ffbef2b567ead6b9558647c4751bb2f0", "a12c49470e2ba9826b564cae78d1a6216eb8ef168090f1fffde79fea33c710bb", 
"8ad01b028e6aa711d26879d346a7bef82516e372e0f14e8e69db6aef0f25d992", "d8ec8ec8dfa582c44e81b8a7fcc44defc3d2fa658f75fa495124aedc3b0db367", "c72fa801f5e95e34dd2778147466ee5b4e673831fbe2d5c8c91eda3a495bc192", "efd24f8cf96a470074e39c99eb66422b44a88534575708abf4f5e7e166263e63", 
"e33f0e3cb4c42de521f2ac3972403edaf1c1b95b5006dd043175495940d43b75", "6abc2b63f1865a847ff7f5a9d49bb944397b36f5503b9718d6f91f93d60f7cd7", "7dc7223b4e1e7355cc6d53acc4ec254cdda70f4be245a89feb43fdcd9a49f5a7", "031832df121187822bdbf7123d51c5ccfa185f864ef878019aa909f3e49e9889", 
"75a36b19ad12437c9acaa22f4c4ebebfb15590c9bb1f190d41f10ab20f9a1369", "4e37f51244a9d20fd84a7146d86ef4685f1a9339ce9e01b8ad1d1e99e2fad118", "e1204ebbd8f15dbf5f2e41dddc5337e3182fc4daf75b05acc948b8b965480ca0", "27eb1fa70f12deac75e2914d55a9e1d9ef631580d735782d2b7494d735b1743e", 
"d1bec48c2a6a014d3708d210d48b68c545ac086f103016a20e862ac4a189279e", "1c926d4bf1a99b59391649f56abf9cd59548f5fcf6a0d923188e7e3cab1c95d0", "f8db380cc495e98c38a9fb505acba6574cbb18cfe5d7a2bb6807ad1633bf2df8", "0b647d07bba697644e8a00cdcc8668bb83da656f3dee10c852eb11effe414a7e", 
"63dd02c371e84323c4fd9a161a75e0f525423219e8a6ec1b95dd9eda182af2c9", "ec4cd040fd14bff86f6f6e7ba357e5bcf150c455532800edf97782836e97f6d2", "bb45d8ffe245c361c04cca44d0df6e6bd7596cabd70070ffe0d9f519e3b620ea", "e67c7dbd51ba94ac4549cc9bcaabb97276e55aa20be9fae909f947b5b7691e6b", 
"ac4809764857a44b269b549f82d8d04c1294c420baa6b53e2f6b6cb4a3f7e9bd", "45bf0057b3121c6e444b316afafdd802d16083282d1cbfde3cdbf2a9d0915ace", "3c9dc8ada56adf9cebfc501a2d3946680dcb0534a137e2e27a7fcb5994cd9de6", "f116acc6508843f59e59fb5a8d643370dce82f492a217764521f46a856cc4cb5", 
"d145058398705d8e20468332162964dce5d9e2ad419f03b61adf64c7e6d26de5", "fb49dce92f9a028a1da3045f705a574f3c1997fe947e2c69699b17f07e5a552b", "dfd631e4d1f94f7573861cf438f5a33fe8633238d8d51759d88658e4fbac160a", "89c177d9b5788141994b89fd583ce9f408436ca2cb62e10871a33a22e1db8602", 
"d98423ee9a96da10b6296df01ec0198f82df6390a0e93c7cbf4d4ab6e3a2cd63", "7ad64b64e0a4e510be42ba631868bbda8779139dc0daad9395ab048306cc83c5", "f12caf817c39f8e3481d4a7541f5712fea62be76badef9e849fd9e8af67311fc", "9d6e45f11d4f149e905ac947c6ff82f57f0d1ab12e110c356ad1446f7f0f83a9", 
"7785aa23a77f03e4e6680aeb150b5cba5b0047a01311e062640a5388b7cb1d55", "167bd6ef885b34254099e3ffd3b5f60e0f832f04cb8d7e0fdc261d6018a05cde", "2ed899c6602f8be6b22dffad982cdd52ca95524e6822c680d8b428f27df1280d", "e1e9fddcaa7645ebcf5296f33c4a63bdee397b9bac8f5c12f32cbe9dab944827", 
"46e2d5aaa7b022af6e7fedb39df9735f025fe6654c7fa824daef1a982e912ded", "7ab1b18e9913eac24d3820f3ffbd36bcc27e34eeca07dd93f40254078b02d1c0", "a73905a451c67c5f3d735ead92cd62adab600bf81d22dd2b1ff7785512f70052", "62799cc90b1b39d6c97726edd36afb43c7453d2209066d98c1ac2a71e6d0514a", 
"17c35353eadc7e5aeaf3d701e5c8df6842ff06a1aa253a8aabe5f20a85db9411", "6b881c01cfd728718ed7c197e1041757ad642fe9b35573f12133edea5d976cee", "8b1b3ececd28be31043a4dc0d93e70f47f9a0baf4dea00ef3fd7f3be5cbfe434", "153f0324269b9585745676bdbb816d5a13850fb0166beba8f252106da8347c0f", 
"91d743bb91804bb31787ccecd147555619a2b9c294273b73dffd47ea9ea50b13", "3615a646f42aef04df39c9bc3dad622576aa40e695774a37767574522d9a7bb9", "60da0a455fd0ce56a08c1221562311c4da55e32be7a130a17ceaeb8ff2e4f10c", "2d583c3e7c05de95da435f2d12b90bd7196c211eb2245c3f58ee853f03c6493b", 
"ca610fb8f3f53060121e5b650bfb7243be3c55c37a07d56a939a07db2a363681", "5e7de316f9657bbc4039e79ed448f02dcf3a0ea07089b67cf7ba7105caffd68f", "92d61aa3278bb8054e78b5560d7990a3ba38904998c627a21b1eb8bb5339f828", "0cb7eb69a0285a161f3b65d0a32697e688677c69cb633719e352ff8eb3f0b6cb", 
"4d4a37d1aae8646a4490119f6dcc2a7bcc9d057a6623ea2a8e112be069118126", "c435d77f948b39e98cf1b0be19af95edc4d6841f9677aee15f4d0c8fa41db318", "faaad5bbb7584a042400a4b1df4d29bd70a9a47ee7c2c7d14b039278b5284f0e", "841639dfde7bef31afb79d4f4a065174f2dc4963fa7ccb6ab5b0442374fdd0ca", 
"35ffbc55777d7500efd54aff22cd2ba5099e1afc9f1db5b962586eca16a99f0e", "3dfa59a28b562577fea3a5b23f778c00f46aa1961272a53cfa6f95cf0100cd73", "bc856ee826aa91e6cb60d1997389a1189b6083cec69de7af71e39d5a1a0cae2c", "cafd612ebd6bc497a7a05d3dfef133a0b793f1e04e277b31c424d6d8892a1d48", 
"f7bdb791e76f24ddd449bb31de028cfdf073346aa5c00d55261c657b0516d8e7", "25fb23868ebf48348f9e438e00cb9b9d9b3a054f32482a781c762cc4f9cc6393", "d5a89e26beae0bc03ad18a0b0d1d3d75f87c32047879d25da11970cb5c4662a3", "d465172175d35d493fb1633e237700022bd849fa123164790b168b8318acb090", 
"e883180634c7ae4aacef5edb34bfe32beed8d2fb880418eb57c11a1fa283f8cc", "cab538fd1647961eb35348c1bd84e1fde389ad89672587d2fe3c007a0bc9e67f", "4efa610822deb0dcd3ff304d9621256bbf956d94c6ee0e8dbf0ebeae3cca5098", "d50b9852ce176350c41f3a8b9bc01132659f8b18b9ccec1cdea6e98d28176daf", 
"7e9cf0faa9d2a22e49b1d17d77f3ebd9ad8c9a6dc4244bceecdbff5356909166", "7c42c5874638cb2e68a901afa9a50e30a9c51c6cd693b704d082fc1bc71e6718", "1c74d9f96288708c1102e34839400714f9361e08bfdfa03b10559fedf425adf5", "89e3514271a8bbfb3ee5c2c9547464d177400136f02fd2bee9e44fff3b384f93", 
"1caa64295b05317916330564b3c9d1dc85d72ca6a3cfe5910c550e33ce48dbc1", "fdb88b5513f9065ea9fdf29b59e3449d7b680c3baeae2f3076676586e9582b1d", "580c1a4a9f8044c6e0c282d0601394d33e28094b4a70ae5fa5374a50e5da9e7f", "8f2270058422f39ff89104cec8f21350c09c033a28ad8ef72d82f76f56960440", 
"cd8b79123a843eee64985a23257e2fab80ef2c4c08427b688ea979671fc1c457", "03675a800d16c894b0684789e0655075e124d2cbe76bd65ccd20520b0584f981", "69b099e4f6fbbfc9c38155032083ee8c963e6346d563f135c6893a192f361566", "d04ac4c6958f3673a88844d5e35498128bfcd777868497ed263afa777f99c235", 
"31940918f6317b88c847be7d9873bdf5e70298927ec6e02e3f6e76e4e432f8ef", "33b8ce3dd2b2ef336bad7b3be866697da52f378275df381c3873337b28f8e160", "599683bf4af7bdcf3f30f3c0c7179932e1aa526ed2e4c8a1a27f05c172c95ad4", "e566982c228fe6ce8fccdf6e0928d52d019ac210c5da72cbc96bce502be94692", 
"bc80736ef0bac499e263ee70eac74a60c20dc2b9c0ee21f2582c9b0fff54c906", "982b986bb578e137f062099427a8caec3c501c84a9e4b22369ebd2badec42fe7", "49c4386d5e8d47eb936075384cf368e1d7a1b21ce2f9a9e5f9abc5c6582956a2", "fc81dcb7cb911671f716ff01dedd6b7dbce089ca099099302d767ba339fe09ea", 
"a48624b8d13cbd03c8a24df36e0eb56edc7ce2c56b6e56957e52cec98ede0191", "bec17d45b9aaa8b9eb135c2a46a25bc157be7f28412794946913b6c5a520f45c", "c2d5b5213302bd97c873af98ea4a4867cb45f6a77c4c2109c07911edd2b94f7f", "09f76efacafca90100d038b185dc6777b6104033ffbbe425bef91b6e48548806", 
"8fc2a577bbb92cdaed235337012e0e75e8147a2dc533ef593671fa6ba2094b52", "c1b2e4d90d324836667785caac69e826d42a69ab8a93d3beb7937f3036d160df", "82baadbfd46bfd3d28af750c80ef0c43c35165f3bc2748cd8304f78fa9761c2d", "a528c0acc6be579a732b563622cf84e5d5229384e526abb88a6025dd8715c5e7", 
"6cc8d0fd65d25e24c2a90b9c587363bd91a1fe38f2683d749540071705e83a2d", "f5fb3b1168122b9b4c8392aa7c45ac32268aadc647ae1a049bc7707efe96f278", "083ae6e37b5cd6460950ef48bac94f9ddeba2bfddbc85c5a7643f8f9f0daf782", "4a2b57e8107c3b66a6d08f27d1eb95140b9a56a8692ac765c4b6a8e46e7374eb", 
"609ff0b6a570b1d30a64b87bac1107729d187475bf0aa30cf86d9a88f6521417", "bfdf1dec757c757e59440fa85bc00531036a5d005c6f1c99a61a0b2c013e4037", "e176e988fb286a4e8f7dfae848066f8deb64887077259e5095df847d041a0e84", "7a51129b7157305155d14614b0e39e13ea0de90f3ed36039bb2290d9cbfacf9d", "d7f0f945a0a2fd89c99b3114a935b84691c87dcc573843737815d8a42800f626", "b868d0d4da893aecb791d8f05022eccd9922de115cb26c9020d9b2b7150d482a", "a1ba490d7ad4a0dd0db46f7cdf5ced9e97805caa9236c36e3c176c42fadcd1d6", "b295631923b42706508de011eefdd1f90eb5289f4ab87c880d413fe1e9371a86", "2278c59e3e8809eac71a7d577f540dfafb6e6c37e4c7ffab4343c12bd8ab4211", "5de1c02a46c93d2fdc74f80606bc4fdf5afe7843fb9c9fdc3b8d8ad3cc2c31b8", "62c1a1ea1d74462ef26c0e8a491174dff58e4989feb0245646bd42d04d7f7495", "43932938adce2796fb13d40a7ed389513c5df0fd9f87d1343b9f8e8eefa5cef0", "d1dc29c73e32c8d667480bd075798258f6d64659a937c8b98caef009bbc24b8a", "2064f25eb5088e6a315dea8c19f6eea27d83d785e9dbfd4696f5fc7fce73626f", "e011248b9c7acb61c829df0600c519acf30a365e6d80d567a72ff554237788f5", "7e05e889519bdd58b629c6feb3abbc8c4b27fa2b328da973636c4653de9a3609", "c4d7261c4f00641513f55a2146fdb6ab1726a400affdbc399705c7fa3d44b369", "598cea0ffa5d2e4bb86f55fb81fa25dcd2d2caa5fc209d63a68f79449742854a", "ad5257595eb8d85168b1a4ffe1354376fb1d61dc1be43af6c55f98e9d2aa907c", "10458666193583d53de00028c18179f27dfd2966f8d3efaaaa1e88c4a22569fb", "b81587016dabc487ec6da40a0a311bed4f6d79423c9fa878733a24ae186a51eb", "94145ce4fbf51c4edfa97cbd529f24db909c076aa4d0d0fc7b1b15155de2e9ec", "222129ab6baea32263c4d41305bff9cb523eed4819b62145e0ce878be41f361c", "d26441717bbacf665d103dac13812a7bbbe0922183123b628b8d01f41bb7d4bb", "c638f8f964f68d694dca378c90acd8915d70c5bb49cdaa9bd3cea750a9f260ba", "ac685d9476ebc86c4383eea742f675630d6fbba064aa180f13b7897576c3ea08", "37fa1432aac29f4ae7ab34bb4900bbcccddd3a00879ae5347525b7a36fca6eed", "52782df92598aba3bc7663c47116b7f4deb2daa5c209347420ad0f7a14272e2a", "d7578f84c92e6fc7309de51e9bbafb7d51fb4e91ca9f17d243f5eb56fa89be5c", "6acc45d0694d8fb41615e0341011c2376c71f03cd66c3ed6007d2da57f39ac2b", "26fc6631991cfbac85febcc2c6e542abc272c4eac6066b787aecee3889f19c79", "b1ab20dda12628f7d48f7d0a434d0e1eac6ba9a41fb0e0aa2908b2bb6e9c6baf", "1b4adb57469331aa02235a08d5aab1c9326fc035132329d85553c649172b075a", "f774ac57b1ad7ecfd1491bfe91727b5ecac83bdb2dce5320a8cff144f09dc9a2", "6461467e94b00ccd3dad3cc807096dc6921bfb6c54c4e45d240351795d4fb31e", "1f230ea185093b85417e739993b3779eb4eeb45f0d47894cf08c61a6b1462449", "9db86b2c04919b5f5f7ea094efcf5068bd00bdf3011e75bd3f2e00f933804721", "e97dacea33eb345c19f2d9396eabff270c25013629c91721123f3548aeae9e9c", 
"386b171aaafadcab11b8af6cbeeb1fc64e0f9a14cbc429e359f4de83a4222d7a", "9c4caa0ede67bd89cb4127af7b3e3829567f38bfd1b2401f739b3be2e0436a12", "8e21fae2584648b38800f0fad13ebca75a4c9fbba68e596ef5a92c5de5a132df", "83c4f4de0d0e40f805e5114943c25eaa4d397118144f319631b69794b7238eda", "25fde653e1ec60598c19a8abff74d6d5a1a2e457115de37d6e01c5c7f287832d", "9c2d6ed8a9fa4f88ed955a152fd01a31c83f8d9a15c40ff99ad0720c1b479e22", "7f219642ac3c3850975c16cde166757fde08b2258e6e592c6a9c8515a2906fdf", "6cf49b67d58ca97912d2174094df29e0ab403f907bc11626a09e5d617be2613d", "76fd5e1e701e4605af45e6036537386ca91baee4003dc0311449289f6f320da0", "a6ad7cf21a2dfc8fcac112a2d60a96b60d6c596f82afe17d1e5c29d55603afa2", "aa15f0e314e839e00d33263515d17e82872115ae83a9ffb6a5d2183805ac8545", "289044f449956138d033433efc629a0e0642e6f7239e325b8437299b5d245305", "43b3438e057a760a11f43d3e346e0dd5971c76991ee1b97714529d9e8a5da4bc", "5420751df27a0f6492d7e9c06e7fdd89be004f10ccbc00f3534e8d70e9a6289e", "8d65b477dc1852a4d6e55df4b5f5ee7c4569806cdf50982d6c79bf2158898b83", "20b1fd46f2e9537d24a5fa12607cfe36a2c5e975751c075c8751b007ada5d97e", "6e48c0625d596f354ba601fe7b504828651e23f2e65829647919f224dbe8fde5", "57b2ce7bee8df569af6bc503356dacde9565122e755b090a6aeb51c35a89a8a6", "db2cbe6305134c3751fe7caf719f7d0f1368718877b230f07b54d5dd779606e7", "b5179565d69b8a560252ba843e8d6e1c763e49ca600ca9db268fe329b2aca00c", "f187ec6586c41d64320c8c2cb1894af59fab3601e3c3efe80f1cf1565f5753a6", "17fdc686ac3e28d3723c313771f179adee65b81449b49423612f7436043b92d9", "b4b398059490bbffb8bf600d54da4896f6acd9b5c3880d0abb187dc3d3f4499b", "e97ce28407708d3813a807b9a6f85516ee3b3c20ab87d6663b5ca90f83d778cf", "81181b3807199009fe4c6a74b74b56ef0b2207ec40e96aee9b3c9a0e6cce64bb", "7438d84bbf1bc007988e7b67815f77cd0bd2820f838adb5f35be7740dafd5c2c", "28e4f522f708915c74efea9f847080fe50ef92f16f4aaaea8371ca8fdbb18fdf", "cfa2732f97652929c2078148cef5dfbf2f35a8f6affd6ec0d00a8376d8ba40a3", "68880215568941aa078bdebe65508afa64c97a63bbc0b3464f79025f042902fa", "0cb9c6f86db79c1764ee8e6e343153c9b78ee20af93c59a354b379301e8a1893", "e55536fba67b9275de1b74e4423379ea0238a67b0518d5bb0be03d1752b21f77", "74eb6627fa49830d616d9553ea2b30ad17ea49a05029d1f1f156f7fe2b936d38", "2035481ad5033704892187d2557c74181603ec85cf4cf30ac5b8f029d10416d3", "255bbea19e3540d36c34a23ba1c27f19d4d919accc6952ad8772fa9b1337b319", "f6ee286c3491b9a990d19b022d818734ff048a93a5bfdfea799700663bacb26e", "7b35176f2e7af38d2bee6ec5fbd1ddebb746e88e3bf20bb5e047842404f24cdc", "8b76093340a228d2bff0693f8ec0742c52ac42ec363fa5047402fc7bedd0beb0", "b19af8de9697e20570beb581f91afbec7f87ee030d7e255915ade8642aa50a5f", "2e8c865459064f38a48158a40cb8e2d7ba1dd853ef7d708728a1d9757071478c", "74ea22721aad9696a2c42be997e6c32f97e1f529488a070e542f147dcb681a53", "464829643a47166115404a107b5a855092d51adea6b7a4aae8911d2070b36755", "4e216640e2d6bf091839d7b356dac96ee0242dcf2b09993df8ed8abddfd127c1", "38c187db3dfd098575f61cf0006f51a3c515ab09c2d4f954b5e987f2cb4b822a", "0bc492f15b307b495047b4f4877f575fdd9105785b98f325787aa1d20fcf6d2f", "cd276303d4e3c54bebcac37761f1a73953bd1a5ecce184d8d0684915c19bcafc", "35ec609aebc3f4ec907310e0b024606ff2824b2573e061f730c8e0ae7c207a9c", "71861a9406893efba1412756e0fa65dfbcf1fcadcc93c6af4f765cd8dde76016", "1fbc1c58c0988ab528c30aa328cbf4028ffb05630816cb943cae1f67bdc5111b", "20f4515aa0be270bd03035520e0f0c312a883b19d6973ba5389a75c51ba5d500", "4863a1eb40ac86f0d5538d3f4116d3ca739652fbffe0702c433fe669088554b8", "d539729fe79c6e7da990e2cc5539ba1189ff5623da9f3a278a729d5c51d6ba51", "6266df5095d235f2d679aa289e6a6e4e5dbbf8c3697405cecf63c4519f5dc2d5", "22a2ab80919bf17013ecd9b9c36c07fb4cc9232587058b7d3614b428a6d50891", "b604150ef74651e6d1a31c629bb978d3565ba291f5b4ba088c4ddf93f411e5d3", "edcde2cde5bf98bf9d4d6aac83005ccd997fbc6e399b58b148b310d021edc946", "7b5db26d4d1c81ebcc38b4e18f1bb1b5363f6b13c9d59cbbcace755d530a17a6", "743dbc684ece09ab5306b818d5adaab8523b4383a738ec81cbd247ccbdad8ca6", "8092168a34ce3ba10741a1c6ebfab5c34cf8e426921f082aa26b7c8d19677b69", "30e42ddc67f83d648085785807abc8bd0519e20ef48ee889706ea693f13b84a6", "de924120652af58264adfee3f04a761c53e1af982c346bd2f7ac8558ae3b76c2", "55c400ce092a1cfd57d8f42b3275c08dbce4185d2f18a65e4b288ce505af8413", "9c7ff11ada93db8f6b93463f24e84491129c6094b4adbc1c5a3924928ef3783a", "cb3060730158e55e37d709aefb9a5acfd610ab685ba864d32cc18687bf79b987", "f6bfe74489048e2ddb6d9bcb6eb566397525b2341ac7444331c7e48034801763", "477e769f3dd77aa0e8a4779b5d8a700238e53acab08af3687830fc3a902d1723", "4b62ebd9095b05d6da2b59db1f5e1c144d6f5c1f8f662cf6d35e8c96e0d8d393", "ea1219ab78615b2da77b30683d7fa7dc59f6081d4b83f89a997846e7a932267e", "3ef24d8b60e16be6d71dac9851ebc85f5b128ecf6ae80880c7ba4e44cfb59c55", "cbb7ab17e9d5003b6a58eccf882624f2914ed14e0b093806fe83d3e2b7ba6422", "73a9e0eec95e10855d7abd84c27208f881944a4603ab6074bc95f060d45d52d7", "e66a017fdb8d050f8497d367ce1c3cb02a5d6c6bcbf7f35ce11daf8969b8495d", "d711112448d78ffa3ac8b5e2b86fae3e9248b8bf5035475cfec2549a275f6437", "5898ff655531cce98050d6ac064d14b5e64249c3e8a01110e12b46e93bf72de9", "d1be715208000b0f98edfa29523afe0854448f89b8c983c12948ac2b5fab0e61", "be517d461fc35d68102f4ec5352c5ee3c0f0667258ad9f05a5058d93f7761a40", "005cd81aecfbc8c6fd42a04eda9cd56f8a6787139175baab4d6fadcc94df9163", "22c8521047262641aa3db244cd31f8488ffce9a9e1139ed2df5bd2a54c4da8e8", "3a083de25b3f410bb38e390170603d6226578ece3294a9182c281e7a6b34ecf0", "6730f104cd8543a3659229f83911f345d550180e263fa02929c68c2467123006", "5be11e3019aa07ae191692003751928afc8e124930263303ed1a4c52ac4b0aa1", "60be32d0bf29775c7bfeb9cd6c5bdba21dc57402c473847a1786d956a1521d11", "264db5778f1124faf9db9eb2a9e759d237ab721f1a3d69b680d9232f54883ab2", "fccf7cb30fae9492d18655b68bca2990e65559e2ed7bfbd72fd0d060ce1c093d", "8cdb32a0a51012c3032d2c7f0d643b73f47a58dadcc5761b0994631eccb47972", "152e0632c85951032bf19e19ae2cb08294fc43a52e83f5e36736c769c3758cfb", "5c39ebda58d5cbd9e09eebd022ecc93c92be2e034f5d7a338b68b2ff43a76c56", "df43463af8808bd949062c0251e335ae0e549fecb593017efcbf9ff3da955e4d", "dcfc0fa7477429ab2c4763263070679676747966e3e6e7d665d309ec17bf7eb1", "1a32a363ac867661942b3a35fb0b84139b88f00da17eaf44f5149bb7a502ca86", "4527dfe034b14badfe2b1b27b76af6661e26b103cbf8211956b270498acdf319", "5a2e18ee9f34edc0f241fdd4c669507acf50c80f016a06364156b21680d8fc1c", "4f638046c54114af767cf40a57354580a23c602ffc33d189eb6cce8c96a78895", "ee022b7ae83e1a90fb8a8ce7eb10d4be2ee062c6cbc90e7f788fb970e2312441", "03490318399556ab982991d92bd204d8a5736729df16e918b526b9daa58c6d0d", "78bccd5fc39b2c644ec125fe4e38ab5cb1f41d29b422c3f748722edf2f605574", "76cb791a87c78c1ee51739ed84fc489e0413f8a73f88f8ebd4f53afd7dd2fb28", "50b64b1ea30f4b34bf7b7142d996840c2088913b7da811f0f5ffcebdcf277ec7", "b7bec7dc92fbf9bd01d2820fc2565fdc7224ca760a1bb4e016fe9de5a8e930ba", "8bd6f42fcb01c0831b29b47b2a08a0e602050da2e4ebe698e6e7494a56df961e", "84f7a62658c4cb02b9ac37d5493d0d987c574acf6c4ce4e28087d1975c9e2b4d", "8b0cd3492200548f961578e92b8283fb797f4d3c763a9a3c3b2f2f1808a7017d", "17ec30d724613be6b7fbdd37ee03cd3384c35a161a09fff47d8da53ea2786c9e", "c396136953dfb08fc28a4f50d7c950b61a5d24eb7f67107ca268da214a94e4a6", "8962fb7f49b2734632caba091e81a3bce86b0252dd821e8c030ea4adb6d880e1", "74a23626871972febd09e45d2fe5f9896ec25858907c46a069a5d134e15ba207", "acf233a745bd9274afa42a687adc8cec6b0b8327e117b463b8ca1858b9df542b", "fae406e46f30d604af1825140e2838fe738af7d076d961488753f730e984ba2b", "ed330975dbcce7d6323b2c6ae12e18b5b41f8461661ebdce42b1e6e9b9d68e57", "a485ea99eef58d8b0f082469e5ac09a1e1368e722e4b06e514d4bb78af5399d5", "d9b5b00da47a60176c49b4f4c174a154b0f6d218024c2eb7b5a5d32b57d493f1", "257343bd6cc31bc8efeb0791366c5a22c41be2331f1e85a063b433b7ff2957eb", "7d780b149fef1ff9902741a801a997f1cdd95f0ac02fd59e61b97af7bf0f76d2", "edaadf9621ae06dc6ee7912b35197261e5df51475ecd65d1c03116d41f1447cb", "5e066f617583c22391c2f9808dc441e800a70edc2e2a0394ae472071daf986b6", "1d80e0e67a26487866b520ccfb03d915b45f0e17389ba15df7cfdac708bb23d5", "8ea3c54cde37cc30ccb3f7a838c4ded20185671ff2e9c2dd80b60d94adfd31f4", "65daeca4cb6d3d1cbb3a8a7920e3863b8b9d3bd55915e8cfcb4aea9879bfbf07", "742c5b39cc96c85ab3bf59d00cb6408aa8b075cbf34dd5802bffdbd4f54f0e2c", "11fbdc67b864b3ca3c629de32abb10724bdb9db3838848965c6097d9a6c9f14f", "8dfd3186184f7e4f7eb128150361d980019bde8d00ad1497506d80f12c98846a", "890f22f9ac0dc5c02f9718a85ab5d4229b7df7ed42f00a829935bc8d27f18ba9", "df2aade03d0ed2f264e89bb3e0d610b251ecfab3b8af065895cbe118f9af4a89", "264b03f67f9b9563a69ca999e9f559bc40f1c59e64cdb314351e051da6654880", "b2e1525cfe8e51698d61d7789df5dc3b62c70d59b181444a87b9ebafd1347710", "1baeac05073dfc4b28f1316464ca7e1262e553ff3804860ffc2eb2caef923b74", "7c003bee76f12adaaae6586b679a083d8b3820b72a349459c5540af593d186a2", "990771886560831383d31eb1efa93785ffc92839a4901cd539c7102cfbe43a74", "c45f73e9bed88d7ba27e0f7722b1a1de3dc492cf4bb9eaee8cf67a5402e1c712", "ca22529ca033b6e021b6937b14d161760e0527204a47f6ac25e006052d02fbd6", "f47d264469b181a29a537b11b5201efcfd7d29525c508423abf67a232e59264c", "08bd0be3406449c5a65a6c925bb654cca67b9260d933971d79cc1d59b113f0c4", "7fa2a54e3c6e6d2719c1c6f65d46349819824cd29184d90f4e31c1596b738a3a", "a3329073c3025eeba2c027dca315f5a2c223f5e891e16393d7034c6cd56a916f", "d34c8be9319794abfc84e69b7103693df4843f5cc52e7725c176f64191325adf", "1885e94ae67642a1dea5f00ec9f1e6e5b9f40e703bea33066701f9eddeefd5e4", "53907c2b36c6feb096f42f6c4482f8b57a04aee35ceb036d1d688e9139d125f1", "b663321ab439cc53a329ee352c1b855d9998d3af95524a05795a88b42a9acf07", "fba5d4aa1cd07bcf0c767523b55613a2be795d77d5b7717aef3c2d03ceb8a147", "36d9b23bc2c8c738c31439180e5a8565ab9b89be91e5fd961a0047e4dbb6922e", "f62932f052738722c703419f6d108508335817b9cc0de2740e68879849ada61b", "08648ecc1fc93c0d761d014ef5ca4ba81723cefb73ad0761e4c8b674b7f47560", "caa8e6c704fb56dec005da9c674670a3e3fc3e7b8f86daf379e983f31957cc4d", "a80b0b44828566f1a19ccd9f19eb0d4c3e7d0ea84c6c500d3066040e48b3ea24", "d3adcb66158a161b8d79c452f3f0fa44ef706b889258c3605241dac20da5d885", "0032588b8d93a807cf0f48a806ccf125677503a6fabe4105a6dc69e81ace6091", "caf3e213560f8269fced59c2a5cbb83267eb8a83afbac5f06e772ced80fe2a9f", "18e687bae7f03b568414db41e5e5fe36e666c919b071fc560942a60ba5a9c99e", "5fd55da8747d933410bb637571802aca2eedf3314039722e2b9d6f37afdad97e", "61b30d408583991fd69f3dec694e154cb652471e663328ad9c8482c9021ab5db", "08f81c0efb12aba092c0e212bd539fb636ded6502c51781b5e135da4f85a615d", "301bd9f16f94feedfae7a946a14bac38cb73c43efe6117bc5586835af03d7d6f", "c9c89d274726b86306e1c97d80360f820bce86042c34c9bb2487aac4ada6d606", "0cd6aed5d21ae37310b3c4e0facf48009005018bf4402fbcda1cb66d69b03346", "64e0d721da1996b3da241306e370b2353fbf861904911668820051d3ad12794b", "4fee32fb8b130a7d5c4b176767a85ab4c5bd6cb1f6cd0a7c506aa476ccfaec0e", "cdf9d8eee8c4fe967fac3aa9218a7227647ae7aaaa4221c688e1aab7a9180f69", "f04f89ad9d4d1a4e84531986d45ecff9d2a46395f8732e29f203d915eb25310b", "32f2fa940d4b4fe19aca1e53a24e5aac29c57b7c5ee78588325b87f1b649c864", "d0ac7a2d9454224cabcf7f4899f1cc2d591e16a0146fe14cb3582ceb049b8664", "f0bac1f9c2dd77dbc2b683d49b0495ca73d71ce4974ec598521b6ceb75cec312", "8b1bc8d5c4b397fdf1eaa065605721c5a8d68242ed46a4bb92b632967276852a", "dd134a10aa5816a7d73cf8c71129dbb20b86e10c9efe2a3b6ebb131e52d6ae58", 
"4958d4ed61d9d28140d24da82504469bd90dee7d82afa0d76d5ed002e154d9a7", "a34b9c94ce35c04ec8422933df485c83084ba3d1c726b935699298dbdb92bb19", "7d30787fd4b338186a145aa5d2f4703a0ab02bbd29c46415cabca369b5195373", "69d11528ee32902d0c47ed215877f0610399536f755db03ed02a77ecedd74751", "9c8c654fe26ffff624d54b10e91c30938ac4019fe8c64eb6d739783b9b5f10d0", "8548215da9bc3fa053e973155fb99462a65aea8b9ee8f6419a1d2c11ca0189f6", "5dc1ae0b875dc0d78dbc5532226f5f31b762b4d1229984f605d27bf895ab6807", "9e17cb15dd75bbbd5dbb984eda674863c3b10ab72613cf8a39a00c3e11a8492a", "0b52c5338af355699530a47683420e48c7344e779d3e815ff9943cbfdc153cf2", "d5558cd419c8d46bdc958064cb97f963d1ea793866414c025906ec15033512ed", "55f7d9e99b8e2d4e0e193b2f0275501e6d9c1ebd29cadbea6a0da48a8587e3e0", "3b21c5e11db38e8180ac4f860789b8f98b900aeda4f9667b174124a0abc011e8", "16f2aba19a302e36f7500f8bd458876a2dadbc3c524928065c49b90e1faba5f8", "6612715e5326d111b46d96c6ede8a979931342a605024b66a8c3e13a1763c685", "b70a53a7c19203734ad4a18b44474dab9de88da1557f2c024f160903e505f2c6", "c9ddcba0270fd0f8611f2fc6182581fb8064aff988832c5a8fcb4b5101c041bd", "32a34c045ec06d830ee54203e795c3f154c3ea91e8a429a4d0cd67bddc0279c8", "d9a792dac257b91e52f1f9c244ff7af74df937b7bf2aa036a3ed693f63e34159", "4aab913cdca4ffd1c8f0137617867835d5fb84380e16b814c905e30dd3927ae1", "bb9b84c552e6a50c89855e8ae9363f7fd75be4b27e5919868738efd58a03d589", "83e14e684e4e6ab237e676ffe1acd4b610511239fc0c0c2ea49977c66af39aa6", "95c0dc38e47f13cf1359bab68a3e5a2dbae8c53708aa7a6077ae548cc7dcc219", "0c2baa28af9315f3d36f397168af70291de0cd73d37e8d194a190222d180c13d", "b5378a12e359a27a0c92f53fefa2b4c21673781b7e76f54495d58ad72a927839", "02ca0fe66f161474ee57752f45fea0643a651bc27f3ec916d1f0bd0f6805a1d1", "75062ad1898b3d7812a947e65f23f2c62379c20e2d7eb5babbaa2c66011abae4", "1f93f4d1f40b25243a6acd807d0e10f1115235b747431ce435125693f1567d4f", "7b81980e919f415b0973d89fcef236e8188c05a3a523f23016a51d37e10d5215", "fed7f770ef4c5af5430c26f0deb77101d108e3736ca6cb29118228580bbe1740", "92a5888dff76f4a5e03eabb3171382d539fbd1afe7a23230fb8b3bb802af14b0", "6548e4a637c61a95e98222b96deb428b75cb2bbe94ffd88614db6936ebbb9dbe", "f444c578ae6ace42f9102e23c0dabfef1009bd5a4f03b6bfae574f241cc935b3", "ccb46f6a1370cd06660686c93001927f95435acbec334e8b6ec0341df3565772", "50c1410e6652f882961791c621603522db788cec8f47f144dabdc8154017bb08", "6e1be1f1455c063cc9f0ad8756fa99d35c1da16af04eb714bf35978e897c3f3e", "734504b7e9b48e4f7cb1343356a27f72a13b05b4d35c3dcba7cc24cc8415b6a6", "87930c6bccd898c6669bbdaf22048d9149b41fb66c7f9871eeaf9a5ada18a71b", "fb2b8f82f8e4f2462cff46df5322aa5ed3ef96c83f3b4c793113bc8160f3f5dc", "1bff2331b58fd01c63a3916001d45a74451e61083d6360b79845426179f10e04", "21d2130be1a447b38a6ac672d0c3002db6adb08f2a18ff85b92d40056fabe9e6", "493fda53120050f85836032324409be6c6484f90a0755ae0c6a673ba7626818b", "6350839a06e32e71b21703f35b3c8707c081612395a17721c33ced1103ac45aa", "5d9deb23246164c49dd38fa63f4a19a396e75c4c8915b400773486081d1040cc", "839488ebc08446a096a893996ed23eac321ac166724cd8c5d9092057834d2d79", "72650565f9674eab14be5ccd8abcd1709fd6b33f97b0851d185170137d8c1d28", "8ccfad48be99b3a5b83994db69ee79aae2a5f36b07dd039684bd6426285dbf08", "f1945cd6c19e56b3c1c78943ef5ec18116907a4ca1efc40a57d48ab1db7adfc5", "5be614bce53f767993a5f5f14a6badd6aae6bf3af7cbdbf4d31520de49e27991", "b77481f346fa319924c35cd03bbfa3f7145fb34e258e42dbba75fc00a0b06661", "52c1e7a2c36be28c42455fe1572d7d7918c3180cad99a2b82daa2a38a7e7bb23", "38ffd4972ae513a0c79a8be4573403edcd709f0f572105362b08ff50cf6de521", "f0b5c2c2211c8d67ed15e75e656c7862d086e9245420892a7de62cd9ec582a06", "bd1e626b4c0a84a9242d71f8ba02bf8dc1223915cc54a27449bbf680a292662a", "b850323aa94690b056ab1d201de73204f59826558a2c39049eeeb3f0ccb61541", "ed938b181d835fac16ac15beb8b627b036f97a18430af45c8c63d69cc52305ca", "fddcee934881d3447632259f135219a9c2416f6499f5beaab9c22343759054a6", "32527dbfeaa7f6d7a87fbb80995607991d3a3720779895f98aa29fbe0e9a190b", "54e3c706d900c51391e477e8aa80f9f2e64fda569edd6c8c6110fe89dc156666", "b2ef6265c33dd30f95d1cd6f2ac2678d7a04e6e2b99e6381dafd40721505b0f6", "e6502955e4ca726d3268d839ffbc4dbb5e1f7eddd68a300d9890369525a825f9", "efefe13f8e2533d38bc50c8d1610f47b40141e79d48d2d895827165e7783f846", "6d1ac0d163ae181c456b91522da94fa14d461936e3686e7a6fa23f64543bc4bd", "87500ac5ea638a4393c92fcf2558e0e233f47bf24587e56bfdf1da7b855bcf1d", "24c82a69e14a6b585165739937cfe07ea293a668cf4d57501302fcbf2ec58c4a", "1a556925153959ee9d7588bc822f1c81dc554bdf717854ba59db1992e9cfbb82", "9a777d457d6b41cfb31456f1ca74e4ca16ceadc9cb1ecb7413266871ecd1f707", "a068e2303399af9a3ee089eb25380f88ed6058be61b28d6c754c73bb7f59a80f", "4019282ae5e69233f74bd8705cc71871b844de2c71c59b6a91b0b40868d55ea9", "c9c45f908dfb5ce709ed05041af8371ff3bae14fa37b8171511f4ee4b56c4cb8", "27509eac3a7400c9000eb1b639fc16cbe60a76cdf14f42ebd74de2da545adc3a", "e32bb2705b3471d37659173c17ac955c5e9ae17ab98d0ec80d9eadc2683afc05", "44b46f966c6ae565bd3f531af892fd29c74094e6932c57eda5da36131bacfbf8", "ec6f0b068a33876ab2ae73bfb5034b17919e3e1c0067783bf53ccc6b2d29e350", "3a648cdff1b5936a56f30ddd7612120dee6ff8d38bc0bbbffee2b3553c9db85f", "56033f5c2fa3605647951a7a0a5b75c6af2f2eeaa28c17429792f7a7566e1f78", "dcca3b55291a3120f3d2bc96969b9c82afc9e6c1bb7de0f19ae3e38585bf17c8", "b85c25b25ad172447aa90547c2b69f920634e68029dbafa64ec9d177f67d0546", "02c5cd0cd68a1c29587e802ca7307676512a06c345ae5f19de32648c6957197d", "63da32686941e1608b9dd5191e6b6dd87a24a69ae7d6c103bbda37f3c59e42e7", "a2aae0fe59469e811db3b433715248f5aa20a81b86cfcb7c95935cbafaf229d6", "c57e1999bc1a0452238e6d577ec000f5314fd1e61da9c320495035a0d0ae5b46", "73b0074ea337502b8dfc3dfec59ce703c9c5f9bb23383d26e6a0bd18f2603ed2", "8ae52005f0022ecc1a0cf285d3ead3d2c8f9b147248a6c2db0b90ed06e572250", "1d86ad203d9f732075a57918233257f12d7689499451b75db4bf8318b54b50d3", "b064187ebdc51721708ad98cd89dacc346017cb0fb0457d530032d387f1ff20e", "cd1b09149647902c4417c5a3acaa5850048ddec7ae2a1e42d1f7a83721c802c7")
    | extend DateFormat=format_datetime(Timestamp, 'yy-MM-dd')
    | extend ThreatHunting = "SHA256_Hit"
};
union DNS_Hostname_Hit, IP_Hit, SHA256_Hit
| where ThreatHunting in("DNS_Hostname_Hit", "IP_Hit", "SHA256_Hit")
| summarize
    DNS_Hostname_Hit=count(ThreatHunting == "DNS_Hostname_Hit"),
    SHA256_Hit=count(ThreatHunting == "SHA256_Hit"),
    IP_Hit=count(ThreatHunting == "IP_Hit")
    by DeviceName, DateFormat
| where SHA256_Hit > 0 and IP_Hit > 0 //DNS_Hostname_Hit > 0 