//Looks for programs other than Teams accessing cookies related to teams credentials
//https://www.vectra.ai/blogpost/undermining-microsoft-teams-security-by-mining-tokens
union DeviceProcessEvents, DeviceFileEvents 
| where FolderPath contains "Microsoft\\Teams\\Cookies" or FolderPath contains "Microsoft\\Teams\\Local Storage\\leveldb"
| where InitiatingProcessFileName != "Teams.exe"
| project Timestamp, DeviceName, ActionType, FileName, FolderPath, SHA1, SHA256, MD5, FileSize,  ProcessVersionInfoCompanyName, ProcessVersionInfoInternalFileName, ProcessVersionInfoOriginalFileName, ProcessCommandLine, InitiatingProcessFileName