DeviceFileEvents
| where (FileName endswith '.doc' or FileName endswith '.TXT' or FileName endswith '.xls' or FileName endswith '.PPT' or FileName endswith '.rtf' or FileName endswith '.csv' or FileName endswith '.eml')
| where (FileName contains 'password' or FileName contains 'PWD' or FileName contains 'sifre' or FileName contains 'şifre' or FileName contains 'Parola' or FileName contains 'gizli' or FileName contains 'Passwort' or FileName contains 'contraseña' or FileName contains 'santo y seña' or FileName contains 'mot de passe' or FileName contains 'wachtwoord' or FileName contains 'paswoord' or FileName contains 'kontrasenyas' or FileName contains 'hudyat' or FileName contains 'пароль' or (FileName contains 'parola' and FileName contains 'ordine') or FileName contains 'senha' or FileName contains 'palavra de passe' or FileName contains 'contra-senha' or FileName contains 'wagwoord' or FileName contains 'парола' or FileName contains 'Focal faire' or (FileName contains 'facal' and FileName contains 'faire') or FileName contains 'pasfhocal' or FileName contains 'parool' or FileName contains 'salasõna' or FileName contains 'märgusõna' or FileName contains 'tunnussõna' or FileName contains 'salasana' or FileName contains 'tunnussana' or FileName contains 'adgangskode' or FileName contains 'løsen' or FileName contains 'feltråb' or FileName contains 'パスワード' or FileName contains '暗証' or FileName contains '暗号' or FileName contains '合言葉' or FileName contains '合い言葉' or FileName contains '符丁' or FileName contains '合い詞' or FileName contains '暗証化' or FileName contains '密码' or FileName contains '密碼' or FileName contains '암호' or FileName contains '암호말' or FileName contains 'parolă' or FileName contains 'consemn' or FileName contains 'cuvânt secret' or FileName contains 'Lösenord' or FileName contains 'igenkänningsord' or FileName contains 'fältrop' or FileName contains 'mật khẩu' or FileName contains 'khẩu hiệu' or FileName contains 'mật khẩu' or FileName contains 'รหัสผ่าน' or FileName contains 'คำผ่าน' or FileName contains 'คำสัญญาณ' or FileName contains 'คำขานยาม' or FileName contains 'รหัสผ่าน' or FileName contains 'पासवर्ड' or FileName contains 'सांकेतिक शब्द' or FileName contains 'टोक' or FileName contains 'परोल' or FileName contains 'पारण शब्द' or (FileName contains "كلم" and FileName contains "سر") or FileName contains "باسوورد" or FileName contains "بسوورد" or FileName contains "باسورد" )
| where (FolderPath !contains 'Program Files' and FolderPath !contains '\\Appdata\\' and FolderPath !contains '\\drivers\\')