// Finds machines that store the Windows password as clear text in the registry. 
// Passwords stored as clear text, used by earlier versions of Windows during automatic logons, are a significant security risk.  
DeviceRegistryEvents 
| where Timestamp > ago(7d) 
| where ActionType == "SetValue"
| where RegistryValueName == "DefaultPassword"
| where RegistryKey has @"SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon" 
| project Timestamp, DeviceName, RegistryKey
| top 100 by Timestamp
