DeviceNetworkEvents
| where RemoteUrl contains "tor2web.org" or RemoteUrl contains "torlink.co" or RemoteUrl contains "onion.to" or RemoteUrl contains "onion.ink" or RemoteUrl contains "onion.cab" or RemoteUrl contains "onion.nu" or RemoteUrl contains "onion.link" or RemoteUrl contains 
"onion.it" or RemoteUrl contains "onion.city" or RemoteUrl contains "onion.direct" or RemoteUrl contains "onion.top" or RemoteUrl contains "onion.casa" or RemoteUrl contains "onion.plus" or RemoteUrl contains "onion.rip" or RemoteUrl contains "onion.dog" or RemoteUrl contains "tor2web.fi" or RemoteUrl contains 
"tor2web.blutmagie.de" or RemoteUrl contains "onion.sh" or RemoteUrl contains "onion.lu"or RemoteUrl contains "onion.pet" or RemoteUrl contains "t2w.pw" or RemoteUrl contains "tor2web.ae.org" or RemoteUrl contains "tor2web.io" or RemoteUrl contains "tor2web.xyz" or RemoteUrl contains "onion.lt" or RemoteUrl contains 
"s1.tor-gateways.de" or RemoteUrl contains "s2.tor-gateways.de" or RemoteUrl contains "s3.tor-gateways.de" or RemoteUrl contains "s4.tor-gateways.de" or RemoteUrl contains "s5.tor-gateways.de"or RemoteUrl contains "hiddenservice.net" or RemoteUrl contains "urlabuse.com" or RemoteIPType != ""
